
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Module 5 - Principles of Behaviour Planning · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../Module 4 - Dynamic Object Interactions/Module 4 - Dynamic Object Interactions.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../">
            
                <a href="../">
            
                    
                    Part4：Motion Planning for Self-Driving Cars
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../Module 4 - Dynamic Object Interactions/Module 4 - Dynamic Object Interactions.html">
            
                <a href="../Module 4 - Dynamic Object Interactions/Module 4 - Dynamic Object Interactions.html">
            
                    
                    Module 4 - Dynamic Object Interactions
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.2" data-path="Module 5 - Principles of Behaviour Planning.html">
            
                <a href="Module 5 - Principles of Behaviour Planning.html">
            
                    
                    Module 5 - Principles of Behaviour Planning
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >Module 5 - Principles of Behaviour Planning</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E94;&#x8BFE;-&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7406;&#x8BBA;">&#x7B2C;&#x4E94;&#x8BFE;: &#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7406;&#x8BBA;</h1>
<p>&#x672C;&#x8282;&#x8BFE;&#x642D;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x57FA;&#x4E8E;&#x89C4;&#x5219;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4F8B;&#x5982;&#x6362;&#x9053;&#xFF0C;&#x901A;&#x8FC7;&#x505C;&#x6B62;&#x8F66;&#x8F86;&#x4EE5;&#x53CA;&#x901A;&#x8FC7;&#x8DEF;&#x53E3;&#x573A;&#x666F;&#x4E0B;&#x7684;&#x4E0A;&#x5C42;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x51B3;&#x7B56;&#x3002;&#x672C;&#x8282;&#x8BFE;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#x96C6;&#xFF0C;&#x901A;&#x8FC7;&#x6307;&#x6807;&#x9009;&#x62E9;&#x53EF;&#x884C;&#x7684;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#xFF0C;&#x7528;&#x6765;&#x5728;&#x4E0B;&#x5C42;&#x7684;&#x8DEF;&#x5F84;&#x89C4;&#x5212;&#x8FC7;&#x7A0B;&#x4E2D;&#x9650;&#x5236;&#x8DEF;&#x5F84;&#x548C;&#x901F;&#x5EA6;&#x5728;&#x4E00;&#x5B9A;&#x8303;&#x56F4;&#x5185;&#x3002;</p>
<h2 id="&#x5B66;&#x4E60;&#x76EE;&#x6807;">&#x5B66;&#x4E60;&#x76EE;&#x6807;</h2>
<ul>
<li>&#x56DE;&#x5FC6;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5728;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x89D2;&#x8272;&#x4EE5;&#x53CA;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;</li>
<li>&#x91C7;&#x7528;&#x72B6;&#x6001;&#x673A;&#x6765;&#x5B9E;&#x73B0;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#xFF0C;&#x540C;&#x65F6;&#x660E;&#x786E;&#x5176;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;&#x3002;</li>
<li>&#x660E;&#x786E;&#x7279;&#x5B9A;&#x573A;&#x666F;&#x6240;&#x9700;&#x8981;&#x7684;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x3002;</li>
<li>&#x7406;&#x89E3;&#x89C4;&#x5219;&#x5F15;&#x64CE;&#x5728;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x4E2D;&#x7684;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;&#x3002;</li>
<li>&#x7406;&#x89E3;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x5728;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x4E2D;&#x7684;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;</li>
</ul>
<hr>
<h2 id="&#x7B2C;&#x4E00;&#x8282;-&#x884C;&#x4E3A;&#x89C4;&#x5212;">&#x7B2C;&#x4E00;&#x8282;: &#x884C;&#x4E3A;&#x89C4;&#x5212;</h2>
<h3 id="&#x5B66;&#x4E60;&#x76EE;&#x6807;">&#x5B66;&#x4E60;&#x76EE;&#x6807;</h3>
<blockquote>
<ul>
<li>&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7CFB;&#x7EDF;&#x7684;&#x5B9A;&#x4E49;&#x3002;</li>
<li>&#x7406;&#x89E3;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x7684;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;</li>
<li>&#x7406;&#x89E3;&#x4E0E;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x6709;&#x5173;&#x7684;&#x72B6;&#x6001;&#x673A;&#x3002;</li>
</ul>
</blockquote>
<p>&#x6B22;&#x8FCE;&#x6765;&#x5230;&#x8FD0;&#x52A8;&#x89C4;&#x5212;&#x8BFE;&#x7A0B;&#x7684;&#x7B2C;&#x4E94;&#x5468;&#x3002;&#x5728;&#x672C;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5F00;&#x59CB;&#x8BA8;&#x8BBA;&#x8FD0;&#x52A8;&#x89C4;&#x5212;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x4E2D;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5373;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x4ECB;&#x7ECD;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7684;&#x5B9A;&#x4E49;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x91C7;&#x7528;&#x72B6;&#x6001;&#x673A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x3002;&#x7136;&#x540E;&#x5728;&#x672C;&#x8282;&#x8BFE;&#x4E4B;&#x4F59;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x57FA;&#x4E8E;&#x72B6;&#x6001;&#x673A;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x4EE5;&#x53CA;&#x7528;&#x5B83;&#x6765;&#x5904;&#x7406;&#x4E0D;&#x540C;&#x7684;&#x573A;&#x666F;&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x63A2;&#x7D22;&#x5176;&#x4ED6;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x95EE;&#x9898;&#x7684;&#x53EF;&#x9009;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x63A2;&#x8BA8;&#x5B83;&#x4EEC;&#x7684;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;&#x3002; </p>
<p>&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7CFB;&#x7EDF;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x63A2;&#x7D22;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x6A21;&#x5757;&#x7684;&#x5178;&#x578B;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#xFF0C;&#x6700;&#x540E;&#x4ECB;&#x7ECD;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4EE5;&#x53CA;&#x600E;&#x4E48;&#x7528;&#x5B83;&#x6765;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7CFB;&#x7EDF;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5427;&#x3002; </p>
<hr>
<h3 id="1-&#x884C;&#x4E3A;&#x89C4;&#x5212;">1. &#x884C;&#x4E3A;&#x89C4;&#x5212;</h3>
<p><strong>&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7CFB;&#x7EDF;&#x8D1F;&#x8D23;&#x5728;&#x53D8;&#x5316;&#x7684;&#x9A7E;&#x9A76;&#x73AF;&#x5883;&#x4E2D;&#x89C4;&#x5212;&#x51FA;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x7684;&#x4E0A;&#x5C42;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x6216;&#x8005;&#x64CD;&#x4F5C;&#x3002;</strong> &#x89C4;&#x5212;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x4EA4;&#x901A;&#x89C4;&#x5219;&#x4EE5;&#x53CA;&#x4E0E;&#x8DEF;&#x9762;&#x4E0A;&#x5176;&#x4ED6;&#x52A8;&#x6001;&#x548C;&#x9759;&#x6001;&#x969C;&#x788D;&#x7269;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x3002; &#x4E0A;&#x5C42;&#x51B3;&#x7B56;&#x5E94;&#x8BE5;&#x4FDD;&#x8BC1;&#x8F66;&#x8F86;&#x80FD;&#x591F;&#x5728;&#x73AF;&#x5883;&#x4E2D;&#x5B89;&#x5168;&#x6709;&#x6548;&#x7684;&#x8FD0;&#x52A8;&#x3002; &#x5728;&#x7B2C;&#x4E00;&#x8BFE;&#x4E2D;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x8FC7;&#x5F88;&#x591A;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x4E86;&#xFF0C;&#x6B63;&#x662F;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x80FD;&#x591F;&#x4F5C;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x51B3;&#x7B56;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x7684;&#x8FD0;&#x52A8;&#x5230;&#x76EE;&#x6807;&#x70B9;&#x3002;</p>
<p><img src="assets/1565265630083.png" alt="1565265630083"></p>
<p>&#x4E3A;&#x4E86;&#x5C55;&#x793A;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x51B3;&#x7B56;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x8F66;&#x8F86;&#x5230;&#x8FBE;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7E41;&#x5FD9;&#x7684;&#x5341;&#x5B57;&#x8DEF;&#x53E3;&#x3002;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x5FC5;&#x987B;&#x89C4;&#x5212;&#x51FA;&#x4EC0;&#x4E48;&#x65F6;&#x95F4;&#xFF0C;&#x4EC0;&#x4E48;&#x5730;&#x70B9;&#x505C;&#x4E0B;&#x6765;&#xFF0C;&#x505C;&#x6B62;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x4EE5;&#x53CA;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8D77;&#x6B65;&#x901A;&#x8FC7;&#x8DEF;&#x53E3;&#x3002;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x5FC5;&#x987B;&#x9AD8;&#x6548;&#x7684;&#x5B8C;&#x6210;&#x6B64;&#x79CD;&#x884C;&#x4E3A;&#x51B3;&#x7B56;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x8F66;&#x8F86;&#x5C31;&#x80FD;&#x591F;&#x5F88;&#x5FEB;&#x7684;&#x5BF9;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x5316;&#x4F5C;&#x51FA;&#x54CD;&#x5E94;&#x3002;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x5904;&#x7406;&#x5305;&#x542B;&#x73AF;&#x5883;&#x566A;&#x58F0;&#x7684;&#x4E0D;&#x51C6;&#x786E;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x7531;&#x4E8E;&#x611F;&#x77E5;&#x8BEF;&#x68C0;&#x6240;&#x9020;&#x6210;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;&#x73B0;&#x5728;&#x7684;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x63A5;&#x7740;&#x6211;&#x4EEC;&#x6765;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x8981;&#x5904;&#x7406;&#x7684;&#x884C;&#x4E3A;&#x5217;&#x8868;&#x3002;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x8BFE;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x63CF;&#x8FF0;&#x4E86;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x4EEC;&#xFF0C;&#x672C;&#x8282;&#x8BFE;&#x6211;&#x4EEC;&#x91C7;&#x7EB3;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x8F66;&#x8F86;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x6216;&#x8005;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x3002; </p>
<hr>
<h3 id="2-&#x9A7E;&#x9A76;&#x884C;&#x4E3A;">2. &#x9A7E;&#x9A76;&#x884C;&#x4E3A;</h3>
<p>&#x6211;&#x4EEC;&#x603B;&#x5171;&#x8003;&#x8651;&#x4E94;&#x79CD;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x3002;&#x7B2C;&#x4E00;&#x79CD;&#x662F;&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x5728;&#x65E0;&#x7EA6;&#x675F;&#x7684;&#x516C;&#x5F00;&#x9053;&#x8DEF;&#x4E0A;&#x884C;&#x9A76;&#xFF0C;&#x524D;&#x8FDB;&#x8FC7;&#x7A0B;&#x4E2D;&#x552F;&#x4E00;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x7EA6;&#x675F;&#x662F;&#x5F53;&#x524D;&#x9053;&#x8DEF;&#x7684;&#x9650;&#x901F;&#x3002;&#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x8DDF;&#x8F66;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B; &#x9700;&#x8981;&#x8003;&#x8651;&#x524D;&#x8F66;&#x7684;&#x901F;&#x5EA6;&#x4EE5;&#x53CA;&#x5B89;&#x5168;&#x7684;&#x8DDF;&#x8F66;&#x8DDD;&#x79BB;&#x3002;&#x7B2C;&#x4E09;&#x79CD;&#x662F;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5728;&#x524D;&#x8F66;&#x7684;&#x89C4;&#x5212;&#x8303;&#x56F4;&#x5185;&#x6709;&#x4E00;&#x4E2A;&#x505C;&#x8F66;&#x70B9;&#xFF0C;&#x524D;&#x8F66;&#x5E94;&#x8BE5;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x5728;&#x505C;&#x8F66;&#x70B9;&#x4E0A;&#x3002;&#x6BCF;&#x4E00;&#x79CD;&#x9700;&#x8981;&#x505C;&#x6B62;&#x7684;&#x573A;&#x666F;&#x90FD;&#x53EF;&#x4EE5;&#x89E6;&#x53D1;&#x6B64;&#x79CD;&#x6A21;&#x5F0F;&#x3002;&#x7B2C;&#x56DB;&#x79CD;&#x662F;&#x672C;&#x8F66;&#x5F53;&#x524D;&#x662F;&#x505C;&#x6B62;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x9700;&#x8981;&#x4FDD;&#x6301;&#x505C;&#x6B62;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x505C;&#x6B62;&#x6807;&#x5FD7;&#x524D;&#x9762;&#xFF0C;&#x672C;&#x8F66;&#x9700;&#x8981;&#x81F3;&#x5C11;&#x505C;&#x7559;&#x4E09;&#x79D2;&#x3002;&#x7B2C;&#x4E94;&#x79CD;&#x662F;&#x6C47;&#x6D41;&#x884C;&#x4E3A;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x672C;&#x8F66;&#x9700;&#x8981;&#x6C47;&#x5408;&#x5230;&#x5750;&#x6807;&#x6216;&#x8005;&#x53F3;&#x8FB9;&#x7684;&#x8F66;&#x9053;&#x3002; </p>
<p><img src="assets/1565265937595.png" alt="1565265937595"></p>
<p>&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x5C06;&#x4F1A;&#x7528;&#x6765;&#x642D;&#x5EFA;&#x6211;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x3002;&#x7136;&#x800C;&#x5728;&#x5B9E;&#x9645;&#x573A;&#x666F;&#x4E2D;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8003;&#x8651;&#x66F4;&#x591A;&#x7684;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#xFF0C;&#x56E0;&#x6B64;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E5F;&#x4F1A;&#x968F;&#x4E4B;&#x4E0A;&#x5347;&#x3002; </p>
<hr>
<h3 id="3-&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x7684;&#x8F93;&#x51FA;">3. &#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x7684;&#x8F93;&#x51FA;</h3>
<p>&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x4E3B;&#x8981;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x5728;&#x5F53;&#x524D;&#x73AF;&#x5883;&#x4E2D;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x7684;&#x4E00;&#x4E2A;<strong>&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x3002;</strong> <strong>&#x4F34;&#x968F;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#xFF0C;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x4E5F;&#x4F1A;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x9650;&#x5236;&#x5C40;&#x90E8;&#x89C4;&#x5212;&#x95EE;&#x9898;&#x7684;&#x7EA6;&#x675F;&#x96C6;&#x5408;&#x3002;</strong> &#x5728;&#x672C;&#x8282;&#x8BFE;&#x4E2D;&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x90FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x4E00;&#x4E2A;&#x7EA6;&#x675F;&#x662F;&#x4ECE;&#x8F66;&#x8F86;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x5230;&#x7EC8;&#x70B9;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x5373;&#x8F66;&#x9053;&#x4E2D;&#x5FC3;&#x7EBF;&#x3002;</p>
<p><img src="assets/1565266196151.png" alt="1565266196151"></p>
<p>&#x9ED8;&#x8BA4;&#x8DEF;&#x5F84;&#x7684;&#x901F;&#x5EA6;&#x9650;&#x5236;&#x3002;&#x5728;&#x6B63;&#x5E38;&#x9A7E;&#x9A76;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5F53;&#x524D;&#x9053;&#x8DEF;&#x8FB9;&#x754C;&#x3002;&#x4EFB;&#x4F55;&#x5728;&#x5F53;&#x524D;&#x9053;&#x8DEF;&#x524D;&#x65B9;&#x9700;&#x8981;&#x505C;&#x6B62;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4EC5;&#x5728;&#x4E0E;&#x4E4B;&#x7ED1;&#x5B9A;&#x7684;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x88AB;&#x89E6;&#x53D1;&#x624D;&#x751F;&#x6548;&#x3002;&#x5C40;&#x90E8;&#x8DEF;&#x5F84;&#x89C4;&#x5212;&#x6700;&#x5173;&#x5FC3;&#x7684;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x96C6;&#x5408;&#x3002;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x4E4B;&#x6240;&#x4EE5;&#x5173;&#x952E;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x9884;&#x6D4B;&#x672A;&#x6765;&#x8DEF;&#x5F84;&#x7684;&#x65F6;&#x5019;&#x91C7;&#x7528;&#x4E86;&#x8FD1;&#x4F3C;&#x7684;&#x65B9;&#x6CD5;&#x3002; </p>
<hr>
<h3 id="4-&#x8F93;&#x5165;&#x8981;&#x6C42;">4. &#x8F93;&#x5165;&#x8981;&#x6C42;</h3>
<p>&#x4E3A;&#x4E86;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x80FD;&#x591F;&#x751F;&#x6210;&#x60F3;&#x8981;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5168;&#x6808;&#x7684;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x4F20;&#x6765;&#x7684;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#x3002;&#x9996;&#x5148;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x9700;&#x8981;&#x5BF9;&#x8F66;&#x8F86;&#x5468;&#x56F4;&#x8DEF;&#x7F51;&#x73AF;&#x5883;&#x7684;&#x5168;&#x9762;&#x8BA4;&#x8BC6;&#x3002;&#x8FD9;&#x4E9B;&#x8BA4;&#x77E5;&#x6765;&#x81EA;&#x4E8E;&#x9AD8;&#x6E05;&#x5EA6;&#x5730;&#x56FE;&#x3002;&#x5176;&#x6B21;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8F66;&#x8F86;&#x5230;&#x8FBE;&#x76EE;&#x6807;&#x70B9;&#x9700;&#x8981;&#x8DDF;&#x968F;&#x7684;&#x8F68;&#x8FF9;&#x3002;&#x8FD9;&#x6765;&#x81EA;&#x4E8E;&#x9053;&#x8DEF;&#x7F51;&#x7ED9;&#x51FA;&#x7684;&#x5168;&#x5C40;&#x8DEF;&#x5F84;&#x3002;&#x7136;&#x540E;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x5C40;&#x90E8;&#x73AF;&#x5883;&#x4E2D;&#x8F66;&#x8F86;&#x5468;&#x56F4;&#x7684;&#x5B9A;&#x4F4D;&#x9AD8;&#x6E05;&#x5730;&#x56FE;&#x5143;&#x7D20;&#xFF0C;&#x8F66;&#x8F86;&#x672C;&#x8EAB;&#x7684;&#x4F4D;&#x7F6E;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5B9A;&#x4F4D;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x7ED9;&#x51FA;&#x7CBE;&#x51C6;&#x7684;&#x5B9A;&#x4F4D;&#x4FE1;&#x606F;&#x3002;&#x6700;&#x540E;&#x4E3A;&#x4E86;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x5B89;&#x5168;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x6240;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x9700;&#x8981;&#x6240;&#x6709;&#x76F8;&#x5173;&#x7684;&#x611F;&#x77E5;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5305;&#x62EC;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x52A8;&#x6001;&#x7269;&#x4F53;&#xFF0C;&#x5305;&#x62EC;&#x8F66;&#x8F86;&#xFF0C;&#x884C;&#x4EBA;&#x4EE5;&#x53CA;&#x81EA;&#x884C;&#x8F66;&#x3002; </p>
<p><img src="assets/Screenshot from 2019-08-08 20-17-07.png" alt="Screenshot from 2019-08-08 20-17-07"></p>
<p>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x7269;&#x4F53;&#xFF0C;&#x5B83;&#x5F53;&#x524D;&#x65F6;&#x523B;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x9884;&#x6D4B;&#x8F68;&#x8FF9;&#xFF0C;&#x78B0;&#x649E;&#x70B9;&#x4EE5;&#x53CA;&#x78B0;&#x649E;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x9700;&#x8981;&#x7684;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x5305;&#x62EC;&#x9759;&#x6001;&#x7269;&#x4F53;&#xFF0C;&#x6BD4;&#x5982;&#x9759;&#x6B62;&#x7684;&#x8F66;&#x8F86;&#xFF0C;&#x65BD;&#x5DE5;&#x6807;&#x5FD7;&#xFF0C;&#x4EE5;&#x53CA;&#x5305;&#x542B;&#x72B6;&#x6001;&#x7684;&#x7EA2;&#x7EFF;&#x706F;&#x3002;&#x6700;&#x540E;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7F51;&#x683C;&#x5316;&#x5730;&#x56FE;&#x6765;&#x8868;&#x5F81;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x7684;&#x5B89;&#x5168;&#x6027;&#x533A;&#x57DF;&#x3002;&#x62E5;&#x6709;&#x4E86;&#x4E0A;&#x8FF0;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#xFF0C;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x9700;&#x8981;&#x9009;&#x62E9;&#x51FA;&#x5408;&#x9002;&#x7684;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x4EE5;&#x53CA;&#x5FC5;&#x8981;&#x7684;&#x4FDD;&#x8BC1;&#x8F66;&#x8F86;&#x5B89;&#x5168;&#x6709;&#x6548;&#x5230;&#x8FBE;&#x76EE;&#x6807;&#x70B9;&#x7684;&#x7EA6;&#x675F;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#x7684;&#x96C6;&#x5408;&#x6765;&#x663E;&#x6027;&#x6216;&#x8005;&#x9690;&#x5F62;&#x7684;&#x5305;&#x542B;&#x9053;&#x8DEF;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x89C4;&#x5219;&#x4EE5;&#x53CA;&#x4E0E;&#x5176;&#x4ED6;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x3002; </p>
<hr>
<h3 id="5-&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;">5. &#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;</h3>
<p>&#x4E00;&#x79CD;&#x901A;&#x5E38;&#x88AB;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x5229;&#x7528;&#x89C4;&#x5219;&#x96C6;&#x5408;&#x6765;&#x9009;&#x62E9;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x3002;&#x5728;&#x6574;&#x8282;&#x8BFE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x7684;&#x5EFA;&#x7ACB;&#x8D77;&#x57FA;&#x4E8E;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x8BA8;&#x8BBA;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x5C40;&#x9650;&#x6027;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x7406;&#x89E3;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x9488;&#x5BF9;&#x5355;&#x4E00;&#x573A;&#x666F;&#x7684;&#x72B6;&#x6001;&#x673A;&#x7684;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#xFF0C;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x7EA2;&#x7EFF;&#x706F;&#x7684;&#x505C;&#x6B62;&#x6807;&#x5FD7;&#x4EA4;&#x4E92;&#x573A;&#x666F;&#x3002; </p>
<p>&#x7EC4;&#x6210;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x5B83;&#x7684;&#x72B6;&#x6001;&#x96C6;&#x5408;&#x3002;<strong>&#x5BF9;&#x4E8E;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#xFF0C;&#x72B6;&#x6001;&#x5305;&#x62EC;&#x6BCF;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x7684;&#x7684;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x3002;&#x201C;</strong>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x4E24;&#x79CD;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x6216;&#x8005;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#xFF0C;&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;&#x548C;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x3002;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x5B9A;&#x4E49;&#x7684;&#x673A;&#x52A8;&#x51B3;&#x7B56;&#x662F;&#x6709;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x72B6;&#x6001;&#x6765;&#x51B3;&#x5B9A;&#x7684;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x90FD;&#x5173;&#x8054;&#x7740;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#xFF0C;&#x5373;&#x8981;&#x8FDB;&#x5165;&#x6B64;&#x72B6;&#x6001;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FDB;&#x5165;&#x72B6;&#x6001;&#x4E5F;&#x5305;&#x62EC;&#x8BBE;&#x7F6E;&#x4F34;&#x968F;&#x884C;&#x4E3A;&#x51B3;&#x7B56;&#x7ED3;&#x679C;&#x7684;&#x5FC5;&#x8981;&#x7EA6;&#x675F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x5B9A;&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5B9A;&#x4E49;&#x5728;&#x5F53;&#x524D;&#x8DEF;&#x5F84;&#x4E0A;&#x7684;&#x505C;&#x6B62;&#x70B9;&#x4FE1;&#x606F;&#x3002;&#x540C;&#x6837;&#x7684;&#x8FDB;&#x5165;&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;&#x72B6;&#x6001;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x901F;&#x5EA6;&#x9650;&#x5236;&#x3002;</p>
<p><img src="assets/1565268521658.png" alt="1565268521658"></p>
<p><strong>&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x7B2C;&#x4E8C;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x662F;&#x5207;&#x6362;&#x6761;&#x4EF6;&#xFF0C;&#x5176;&#x5B9A;&#x4E49;&#x4E86;&#x4ECE;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x5207;&#x6362;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x7684;&#x64CD;&#x4F5C;&#x3002;</strong>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4E24;&#x72B6;&#x6001;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;&#x5207;&#x6362;&#x5230;&#x51CF;&#x901F;&#x505C;&#x6B62;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x5207;&#x56DE;&#x5230;&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x5207;&#x6362;&#x5230;&#x5F53;&#x524D;&#x72B6;&#x6001;&#xFF0C;&#x89E6;&#x53D1;&#x8FDB;&#x5165;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x5207;&#x6362;&#x64CD;&#x4F5C;&#x4F34;&#x968F;&#x7740;&#x4ECE;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x5207;&#x6362;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x7684;&#x5207;&#x6362;&#x6761;&#x4EF6;&#x3002;&#x8FD9;&#x4E9B;&#x5207;&#x6362;&#x6761;&#x4EF6;&#x5728;&#x67D0;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x4E00;&#x76F4;&#x88AB;&#x76D1;&#x89C6;&#x4EE5;&#x786E;&#x5B9A;&#x5408;&#x9002;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5207;&#x6362;&#x64CD;&#x4F5C;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#xFF0C;&#x4ECE;&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;&#x5207;&#x6362;&#x5230;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x7684;&#x6761;&#x4EF6;&#x5305;&#x62EC;&#x68C0;&#x67E5;&#x5728;&#x5F53;&#x524D;&#x8F66;&#x9053;&#x4E0A;&#x7684;&#x4E00;&#x5B9A;&#x8DDD;&#x79BB;&#x5185;&#x662F;&#x5426;&#x5B58;&#x5728;&#x505C;&#x6B62;&#x70B9;&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x505C;&#x6B62;&#x70B9;&#x51CF;&#x901F;&#x5230;0&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x72B6;&#x6001;&#x91CD;&#x65B0;&#x5207;&#x6362;&#x5230;&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x4E24;&#x72B6;&#x6001;&#x4F8B;&#x5B50;&#x6307;&#x51FA;&#x4E86;&#x57FA;&#x4E8E;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x7684;&#x91CD;&#x8981;&#x65B9;&#x9762;&#x3002;&#x968F;&#x7740;&#x573A;&#x666F;&#x548C;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x6570;&#x76EE;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x5305;&#x542B;&#x66F4;&#x8FC7;&#x7684;&#x72B6;&#x6001;&#x548C;&#x8F6C;&#x6362;&#x6761;&#x4EF6;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x3002; </p>
<hr>
<h3 id="6-&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x5728;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x51B3;&#x7B56;&#x4E2D;&#x7684;&#x4F18;&#x70B9;">6. &#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x5728;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x51B3;&#x7B56;&#x4E2D;&#x7684;&#x4F18;&#x70B9;</h3>
<p>&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x662F;&#x89E3;&#x51B3;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x9AD8;&#x6548;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x770B;&#x4F5C;&#x662F;&#x5BF9;&#x4E8E;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5305;&#x62EC;&#x5B9A;&#x4E49;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x6216;&#x8005;&#x72B6;&#x6001;&#xFF0C;&#x7ED9;&#x5C40;&#x90E8;&#x89C4;&#x5212;&#x7684;&#x7EA6;&#x675F;&#x4EE5;&#x53CA;&#x6EE1;&#x8DB3;&#x9053;&#x8DEF;&#x89C4;&#x5219;&#x548C;&#x5B89;&#x5168;&#x7684;&#x4E0E;&#x9053;&#x8DEF;&#x4E0A;&#x7684;&#x52A8;&#x6001;&#x548C;&#x9759;&#x6001;&#x7269;&#x4F53;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;<strong>&#x901A;&#x8FC7;&#x4FDD;&#x6301;&#x8DDF;&#x8E2A;&#x9A7E;&#x9A76;&#x73AF;&#x5883;&#x7684;&#x5F53;&#x524D;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x548C;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x8003;&#x8651;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x7684;&#x5207;&#x51FA;&#x6761;&#x4EF6;&#xFF0C;&#x5927;&#x5927;&#x7684;&#x51CF;&#x5C11;&#x4E86;&#x5728;&#x6BCF;&#x4E00;&#x6B64;&#x8FED;&#x4EE3;&#x6240;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x7684;&#x5207;&#x6362;&#x6761;&#x4EF6;&#x3002;</strong></p>
<p><img src="assets/1565269086097.png" alt="1565269086097"></p>
<p>&#x4F5C;&#x4E3A;&#x628A;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5206;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x4E2A;&#x72B6;&#x6001;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5207;&#x6362;&#x89C4;&#x5219;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x5728;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x5BF9;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x8FDB;&#x884C;&#x660E;&#x786E;&#x7684;&#x5212;&#x5206;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x968F;&#x7740;&#x72B6;&#x6001;&#x6570;&#x76EE;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x5B9A;&#x4E49;&#x6240;&#x6709;&#x5207;&#x6362;&#x4EE5;&#x53CA;&#x5176;&#x5207;&#x6362;&#x6761;&#x4EF6;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x5927;&#x5927;&#x589E;&#x52A0;&#x3002;&#x4E5F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x663E;&#x5F0F;&#x5904;&#x7406;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x63AA;&#x65BD;&#x3002;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#x610F;&#x5473;&#x7740;&#x5728;&#x6211;&#x4EEC;&#x8FDB;&#x5165;level 5&#x7EA7;&#x522B;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x65B9;&#x6CD5;&#x5C06;&#x4F1A;&#x9677;&#x5165;&#x56F0;&#x5883;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x662F;&#x5728;&#x9650;&#x5B9A;&#x533A;&#x57DF;&#x5185;&#x7684;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x7CFB;&#x7EDF;&#xFF0C;&#x72B6;&#x6001;&#x7684;&#x6570;&#x76EE;&#x662F;&#x53EF;&#x63A7;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x9650;&#x5236;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x53EF;&#x66FF;&#x4EE3;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5BF9;&#x4E8E;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7684;&#x4ECB;&#x7ECD;&#x5230;&#x6B64;&#x7ED3;&#x675F;&#x3002;</p>
<hr>
<h3 id="7-&#x603B;&#x7ED3;">7. &#x603B;&#x7ED3;</h3>
<blockquote>
<ul>
<li>&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7CFB;&#x7EDF;</li>
<li>&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7CFB;&#x7EDF;&#x7684;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;</li>
<li>&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7CFB;&#x7EDF;<ul>
<li>&#x91C7;&#x7528;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x6765;&#x89E3;&#x51B3;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x95EE;&#x9898;&#x7684;&#x4F18;&#x70B9;</li>
</ul>
</li>
</ul>
</blockquote>
<p>&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x95EE;&#x9898;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x5B9A;&#x4E49;&#x4EE5;&#x53CA;&#x5B83;&#x5728;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5168;&#x6808;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x89D2;&#x8272;&#x3002;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x6A21;&#x5757;&#x7684;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;&#x63A5;&#x7740;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x53CA;&#x5176;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x5E76;&#x5C06;&#x5176;&#x5E94;&#x7528;&#x5230;&#x4E00;&#x4E2A;&#x4E24;&#x72B6;&#x6001;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x95EE;&#x9898;&#x4E2D;&#x3002;&#x4ECE;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x4E3A;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x884C;&#x4E3A;&#x51B3;&#x7B56;&#x5668;&#x589E;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5B66;&#x4E9B;&#x5982;&#x4F55;&#x5728;&#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x5904;&#x7406;&#x5404;&#x79CD;&#x89C4;&#x5219;&#x3002;&#x4E0B;&#x8282;&#x89C1;&#x3002;</p>
<hr>
<h2 id="&#x7B2C;&#x4E8C;&#x8282;-&#x5904;&#x7406;&#x4E0D;&#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x573A;&#x666F;">&#x7B2C;&#x4E8C;&#x8282;: &#x5904;&#x7406;&#x4E0D;&#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x573A;&#x666F;</h2>
<h3 id="&#x5B66;&#x4E60;&#x76EE;&#x6807;">&#x5B66;&#x4E60;&#x76EE;&#x6807;</h3>
<blockquote>
<ul>
<li>&#x660E;&#x786E;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x573A;&#x666F;</li>
<li>&#x8BA8;&#x8BBA;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x79BB;&#x6563;&#x5316;&#x73AF;&#x5883;</li>
<li>&#x68C0;&#x67E5;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x7684;&#x72B6;&#x6001;</li>
<li>&#x5EFA;&#x7ACB;&#x5B89;&#x5168;&#x9AD8;&#x6548;&#x5B8C;&#x6210;&#x573A;&#x666F;&#x7684;&#x72B6;&#x6001;&#x5207;&#x6362;&#x4EE5;&#x53CA;&#x72B6;&#x6001;&#x8F93;&#x51FA;</li>
<li>&#x5F3A;&#x8C03;&#x5B9E;&#x73B0;&#x6B63;&#x786E;&#x4E14;&#x7CBE;&#x786E;&#x7CFB;&#x7EDF;&#x7684;&#x6D4B;&#x8BD5;&#x6B65;&#x9AA4;</li>
</ul>
</blockquote>
<p>&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x63CF;&#x8FF0;&#x4E86;&#x5B9E;&#x73B0;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7684;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x57FA;&#x672C;&#x5185;&#x5BB9;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5B8C;&#x6574;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x573A;&#x666F;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x4F1A;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x573A;&#x666F;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x79BB;&#x6563;&#x5316;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x5730;&#x56FE;&#x6765;&#x5EFA;&#x7ACB;&#x72B6;&#x6001;&#x4E4B;&#x95F4;&#x7684;&#x660E;&#x786E;&#x8F6C;&#x6362;&#x5173;&#x7CFB;&#x3002;&#x63A5;&#x7740;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x9AD8;&#x6548;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x7684;&#x72B6;&#x6001;&#x4EE5;&#x53CA;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x79CD;&#x79CD;&#x5F3A;&#x8C03;&#x4E86;&#x5B89;&#x5168;&#x7CBE;&#x786E;&#x7684;&#x5B9E;&#x73B0;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x8981;&#x7684;&#x6D4B;&#x8BD5;&#x6B65;&#x9AA4;&#x3002;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5427;&#x3002; </p>
<hr>
<h3 id="1-&#x573A;&#x666F;&#x8BC4;&#x4F30;&#x4EE5;&#x53CA;&#x79BB;&#x6563;&#x5316;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;">1. &#x573A;&#x666F;&#x8BC4;&#x4F30;&#x4EE5;&#x53CA;&#x79BB;&#x6563;&#x5316;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;</h3>
<p>&#x6211;&#x4EEC;&#x8981;&#x53BB;&#x5904;&#x7406;&#x7684;&#x573A;&#x666F;&#x662F;&#x4E00;&#x4E2A;&#x56DB;&#x8DEF;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x3002;&#x5728;&#x6BCF;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x7531;&#x4E24;&#x6761;&#x8F66;&#x9053;&#x548C;&#x505C;&#x6B62;&#x6807;&#x5FD7;&#x3002;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x5982;&#x56FE;&#x7410;&#x4E8B;&#xFF0C;&#x7EA2;&#x7EBF;&#x4EE3;&#x8868;&#x8F66;&#x8F86;&#x9700;&#x8981;&#x505C;&#x6B62;&#x7684;&#x505C;&#x6B62;&#x7EBF;&#x3002; </p>
<p><img src="assets/1565270228719.png" alt="1565270228719"></p>
<p>&#x5728;&#x672C;&#x8282;&#x672B;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x80FD;&#x591F;&#x5728;&#x8FD9;&#x4E2A;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x6267;&#x884C;&#x5DE6;&#x8F6C;&#xFF0C;&#x53F3;&#x8F6C;&#x548C;&#x76F4;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x8282;&#x4E2D;&#x4E0D;&#x8003;&#x8651;&#x5728;&#x672C;&#x573A;&#x666F;&#x4E2D;&#x7684;&#x52A8;&#x6001;&#x7269;&#x4F53;&#xFF0C;&#x5728;&#x4E0B;&#x8282;&#x4E2D;&#x518D;&#x628A;&#x5B83;&#x4EEC;&#x52A0;&#x5165;&#x8FDB;&#x6765;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x9650;&#x5B9A;&#x533A;&#x57DF;&#x5185;&#x7684;&#x64CD;&#x4F5C;&#x96C6;&#x5408;&#x6765;&#x4F9B;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x5904;&#x7406;&#x3002;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x3002;&#x6211;&#x4EEC;&#x4EE5;&#x5982;&#x4F55;&#x79BB;&#x6563;&#x5316;&#x8FD9;&#x4E2A;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x6837;&#x80FD;&#x591F;&#x7B80;&#x5316;&#x6211;&#x4EEC;&#x5728;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x51B3;&#x7B56;&#x3002; </p>
<p><img src="assets/1565270333461.png" alt="1565270333461"></p>
<p>&#x8F66;&#x8F86;&#x9700;&#x8981;&#x5F00;&#x59CB;&#x5B89;&#x5168;&#x51CF;&#x901F;&#x9760;&#x8FD1;&#x7684;&#x533A;&#x57DF;&#x79F0;&#x4E3A;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x7684;&#x63A5;&#x8FD1;&#x533A;&#x57DF;&#xFF0C;&#x7528;&#x7EA2;&#x8272;&#x8868;&#x793A;&#x3002;&#x8F66;&#x8F86;&#x5FC5;&#x987B;&#x505C;&#x6B62;&#x7B49;&#x5F85;&#x8D77;&#x6B65;&#x7684;&#x533A;&#x57DF;&#x79F0;&#x4E3A;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x7684;&#x5230;&#x8FBE;&#x533A;&#x57DF;&#xFF0C;&#x7528;&#x7EFF;&#x8272;&#x8868;&#x793A;&#x3002;&#x6700;&#x540E;&#x8F66;&#x8F86;&#x901A;&#x8FC7;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x7684;&#x533A;&#x57DF;&#x79F0;&#x4E4B;&#x4E3A;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x7684;&#x4E2D;&#x95F4;&#x533A;&#x57DF;&#xFF0C;&#x7528;&#x6A59;&#x8272;&#x8868;&#x793A;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#x7684;&#x5927;&#x5C0F;&#x6839;&#x636E;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x56E0;&#x7D20;&#x52A8;&#x6001;&#x8C03;&#x6574;&#xFF1A;&#x672C;&#x8F66;&#x901F;&#x5EA6;&#xFF0C;&#x5728;&#x9AD8;&#x901F;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x8FDC;&#x7684;&#x8DDD;&#x79BB;&#x6765;&#x5B89;&#x5168;&#x8212;&#x9002;&#x7684;&#x505C;&#x8F66;&#xFF0C;&#x4EE5;&#x53CA;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x8D8A;&#x5927;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#x4E5F;&#x8D8A;&#x5927;&#x3002; </p>
<hr>
<h3 id="2-&#x72B6;&#x6001;&#x673A;&#x7684;&#x72B6;&#x6001;">2. &#x72B6;&#x6001;&#x673A;&#x7684;&#x72B6;&#x6001;</h3>
<p>&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E09;&#x79CD;&#x4E0A;&#x5C42;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x3002;&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;&#xFF0C;&#x8FD9;&#x79CD;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x53EA;&#x88AB;&#x5F53;&#x524D;&#x9053;&#x8DEF;&#x4E0A;&#x7684;&#x9650;&#x901F;&#x6240;&#x7EA6;&#x675F;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x5728;&#x8FDB;&#x5165;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x7684;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#x6240;&#x5B58;&#x5728;&#x7684;&#x72B6;&#x6001;&#x6216;&#x8005;&#x5B89;&#x5168;&#x5230;&#x8FBE;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x4E2D;&#x95F4;&#x533A;&#x57DF;&#x4E4B;&#x540E;&#x3002;&#x72B6;&#x6001;&#x8FDB;&#x5165;&#x64CD;&#x4F5C;&#x8BBE;&#x7F6E;&#x4E86;&#x5F53;&#x524D;&#x7684;&#x901F;&#x5EA6;&#x9650;&#x5236;&#x3002;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x4E2A;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x4F7F;&#x5F97;&#x8F66;&#x8F86;&#x5FC5;&#x987B;&#x5728;&#x5230;&#x8FBE;&#x505C;&#x8F66;&#x70B9;&#x7684;&#x65F6;&#x5019;&#x51CF;&#x901F;&#x5230;0&#x3002;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x5165;&#x64CD;&#x4F5C;&#x5B9A;&#x4E49;&#x4E86;&#x5B9A;&#x5236;&#x5E97;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x505C;&#x6B62;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x4E2A;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x544A;&#x8BC9;&#x8F66;&#x8F86;&#x9700;&#x8981;&#x5728;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x4FDD;&#x6301;&#x505C;&#x6B62;&#x72B6;&#x6001;&#x3002; </p>
<p><img src="assets/1565270717992.png" alt="1565270717992"></p>
<p>&#x8FD9;&#x4E2A;&#x8FDB;&#x5165;&#x64CD;&#x4F5C;&#x542F;&#x52A8;&#x4E86;&#x4E00;&#x4E2A;&#x8BA1;&#x65F6;&#x5668;&#x6765;&#x8BBE;&#x7F6E;&#x8F66;&#x8F86;&#x5728;&#x8D77;&#x6B65;&#x901A;&#x8FC7;&#x8DEF;&#x53E3;&#x4E4B;&#x524D;&#x6240;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C06;&#x4F1A;&#x6765;&#x8BA8;&#x8BBA;&#x8F66;&#x8F86;&#x5728;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x7684;&#x5404;&#x79CD;&#x573A;&#x666F;&#xFF0C;&#x4EE5;&#x53CA;&#x68B3;&#x7406;&#x51FA;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x5143;&#x7D20;&#x6765;&#x6B63;&#x786E;&#x6C42;&#x89E3;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x95EE;&#x9898;&#x3002; </p>
<hr>
<h3 id="3-&#x72B6;&#x6001;&#x673A;&#x5207;&#x6362;&#x64CD;&#x4F5C;">3. &#x72B6;&#x6001;&#x673A;&#x5207;&#x6362;&#x64CD;&#x4F5C;</h3>
<p>&#x6211;&#x4EEC;&#x4ECE;&#x672C;&#x8F66;&#x8FDB;&#x5165;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x4E4B;&#x524D;&#x5F00;&#x59CB;&#xFF0C;&#x6B64;&#x65F6;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x552F;&#x4E00;&#x7EA6;&#x675F;&#x662F;&#x8DDF;&#x8E2A;&#x9053;&#x8DEF;&#x4E0A;&#x7684;&#x6700;&#x9AD8;&#x9650;&#x901F;&#x3002;&#x8FD9;&#x4E2A;&#x9650;&#x901F;&#x7EA6;&#x675F;&#x5728;&#x8DDF;&#x8E2A;&#x901F;&#x5EA6;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x5165;&#x64CD;&#x4F5C;&#x91CC;&#x9762;&#x8BBE;&#x7F6E;&#x3002;&#x5F53;&#x672C;&#x8F66;&#x8FDB;&#x5165;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x7684;&#x63A5;&#x8FD1;&#x533A;&#x57DF;&#xFF0C;&#x5373;&#x7EA2;&#x8272;&#x533A;&#x57DF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x5230;&#x505C;&#x6B62;&#x6807;&#x5FD7;&#x9644;&#x8FD1;&#xFF0C;&#x56E0;&#x6B64;&#x5F00;&#x59CB;&#x5207;&#x6362;&#x5230;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x72B6;&#x6001;&#x3002;&#x56E0;&#x6B64;&#x4ECE;&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;&#x72B6;&#x6001;&#x5230;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x72B6;&#x6001;&#x7684;&#x5207;&#x6362;&#x6761;&#x4EF6;&#x662F;&#x8FDB;&#x5165;&#x63A5;&#x8FD1;&#x533A;&#x57DF;&#x3002;</p>
<p><img src="assets/1565270829438.png" alt="1565270829438"></p>
<p>&#x7136;&#x540E;&#xFF0C;&#x4E00;&#x65E6;&#x51CF;&#x901F;&#xFF0C;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x8F66;&#x8F86;&#x9700;&#x8981;&#x8FDB;&#x5165;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x673A;&#x52A8;&#x64CD;&#x4F5C;&#x5C31;&#x662F;&#x7A33;&#x7A33;&#x7684;&#x505C;&#x6B62;&#x5728;&#x505C;&#x6B62;&#x7EBF;&#xFF0C;&#x6216;&#x8005;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x7684;&#x5230;&#x8FBE;&#x533A;&#x57DF;&#x3002;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x8F66;&#x8F86;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x5728;&#x51CF;&#x901F;&#x505C;&#x6B62;&#x72B6;&#x6001;&#x76F4;&#x5230;&#x901F;&#x5EA6;&#x51CF;&#x5230;&#x96F6;&#x540C;&#x65F6;&#x8FDB;&#x5165;&#x5230;&#x8FBE;&#x533A;&#x57DF;&#x3002;</p>
<p><img src="assets/1565270905167.png" alt="1565270905167"></p>
<p>&#x51CF;&#x901F;&#x505C;&#x6B62;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x5165;&#x64CD;&#x4F5C;&#x662F;&#x5B89;&#x5168;&#x505C;&#x8F66;&#x70B9;&#x7684;&#x8BBE;&#x7F6E;&#x3002;</p>
<p><img src="assets/1565270949008.png" alt="1565270949008"></p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x7684;&#x7B80;&#x5355;&#x6027;&#xFF0C;&#x7ED9;&#x4E88;&#x5C40;&#x90E8;&#x89C4;&#x5212;&#x7684;&#x505C;&#x6B62;&#x70B9;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x9AD8;&#x6E05;&#x5730;&#x56FE;&#x4E0A;&#x7684;&#x505C;&#x6B62;&#x7EBF;&#x3002;&#x8FD9;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x4E0E;&#x672C;&#x8F66;&#x7684;&#x4EA4;&#x4E92;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x3002; </p>
<p><img src="assets/1565271144409.png" alt="1565271144409"></p>
<p>&#x4E00;&#x65E6;&#x5B8C;&#x5168;&#x505C;&#x6B62;&#xFF0C;&#x672C;&#x8F66;&#x5C06;&#x4F1A;&#x5207;&#x6362;&#x5230;&#x505C;&#x6B62;&#x72B6;&#x6001;&#x3002;&#x4F5C;&#x4E3A;&#x8FDB;&#x5165;&#x6761;&#x4EF6;&#xFF0C;&#x4F1A;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x8BA1;&#x65F6;&#x5668;&#x6765;&#x4FDD;&#x8BC1;&#x672C;&#x8F66;&#x5728;&#x8D77;&#x6B65;&#x8FDB;&#x5165;&#x5176;&#x4ED6;&#x89C4;&#x5219;&#x4E4B;&#x524D;&#x4F1A;&#x5728;&#x505C;&#x6B62;&#x72B6;&#x6001;&#x4FDD;&#x7559;&#x81F3;&#x5C11;3&#x79D2;&#x3002;&#x4E00;&#x65E6;&#x8BA1;&#x65F6;&#x5668;&#x5B8C;&#x6210;&#xFF0C;&#x89C4;&#x5212;&#x5668;&#x5C06;&#x4F1A;&#x5207;&#x6362;&#x5230;&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;&#x72B6;&#x6001;&#xFF0C;&#x8DDF;&#x8E2A;&#x4EFB;&#x52A1;&#x89C4;&#x5212;&#x5668;&#x7ED9;&#x51FA;&#x7684;&#x5168;&#x5C40;&#x8DEF;&#x5F84;&#x901A;&#x8FC7;&#x8DEF;&#x53E3;&#xFF0C;&#x5DE6;&#x8F6C;&#xFF0C;&#x76F4;&#x884C;&#x6216;&#x8005;&#x53F3;&#x8F6C;&#x3002;&#x8FD9;&#x662F;&#x91C7;&#x7528;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x56DB;&#x8DEF;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x6240;&#x9700;&#x8981;&#x7684;&#x5168;&#x90E8;&#x8BA1;&#x7B97;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x61C2;&#x5F97;&#x4EBA;&#x7C7B;&#x5982;&#x4F55;&#x5206;&#x6790;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x4EE5;&#x53CA;&#x8BBE;&#x8BA1;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x9700;&#x8981;&#x5728;&#x64CD;&#x4F5C;&#x533A;&#x57DF;&#x8BBE;&#x8BA1;&#x4E2D;&#x7ED9;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x8BBE;&#x8BA1;&#x51FA;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5728;&#x7ED9;&#x5B9A;&#x573A;&#x666F;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x60C5;&#x51B5;&#x7684;&#x5B8C;&#x6574;&#x72B6;&#x6001;&#x673A;&#x3002; </p>
<hr>
<h3 id="4-&#x73AF;&#x5883;&#x566A;&#x58F0;&#x7684;&#x5E94;&#x5BF9;">4. &#x73AF;&#x5883;&#x566A;&#x58F0;&#x7684;&#x5E94;&#x5BF9;</h3>
<p>&#x4E00;&#x4E2A;&#x5BF9;&#x72B6;&#x6001;&#x673A;&#x7684;&#x6548;&#x679C;&#x5F71;&#x54CD;&#x975E;&#x5E38;&#x5927;&#x7684;&#x95EE;&#x9898;&#x662F;&#x8F93;&#x5165;&#x7684;&#x566A;&#x58F0;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x72B6;&#x6001;&#x5207;&#x6362;&#x6761;&#x4EF6;&#x662F;&#x5F88;&#x51C6;&#x786E;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4F9D;&#x8D56;&#x4E8E;&#x672C;&#x8F66;&#x80FD;&#x591F;&#x5230;&#x8FBE;&#x505C;&#x8F66;&#x70B9;&#xFF0C;&#x5E76;&#x51CF;&#x901F;&#x5230;&#x96F6;&#x3002;&#x5373;&#x4F7F;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x52A8;&#x6001;&#x7269;&#x4F53;&#xFF0C;&#x8F66;&#x8F86;&#x4F4D;&#x7F6E;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x566A;&#x58F0;&#x4F7F;&#x5F97;&#x8FD9;&#x4E9B;&#x6761;&#x4EF6;&#x4E0D;&#x80FD;&#x51C6;&#x786E;&#x7684;&#x6EE1;&#x8DB3;&#x3002; </p>
<p><img src="assets/1565271481754.png" alt="1565271481754"></p>
<p>&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x8F93;&#x5165;&#x566A;&#x58F0;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E86;&#x566A;&#x58F0;&#x9608;&#x503C;<strong>&#x8D85;&#x53C2;&#x6570;</strong>.&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x9608;&#x503C;&#x4F7F;&#x5F97;&#x901F;&#x5EA6;&#x5728;&#x63A5;&#x8FD1;&#x96F6;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x505C;&#x6B62;&#x7684;&#x72B6;&#x6001;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x540E;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x4F1A;&#x770B;&#x5230;&#x66F4;&#x591A;&#x7684;<strong>&#x8D85;&#x53C2;&#x6570;</strong>&#x6765;&#x5904;&#x7406;&#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x66F4;&#x591A;&#x590D;&#x6742;&#x573A;&#x666F;&#x3002; </p>
<hr>
<h3 id="5-&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x6D4B;&#x8BD5;">5. &#x884C;&#x4E3A;&#x89C4;&#x5212;&#x6D4B;&#x8BD5;</h3>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x7684;&#x5EFA;&#x7ACB;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x600E;&#x4E48;&#x6D4B;&#x8BD5;&#x5B83;&#x53EF;&#x4EE5;&#x5DE5;&#x4F5C;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x6709;<strong>&#x56DB;&#x4E2A;&#x786E;&#x5B9A;&#x6240;&#x8BBE;&#x8BA1;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x7CFB;&#x7EDF;&#x529F;&#x80FD;&#x6027;&#x7684;&#x6D4B;&#x8BD5;&#x6B65;&#x9AA4;</strong>&#xFF0C;&#x4F9D;&#x7167;&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E00;&#x8BFE;&#x4E2D;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x81EA;&#x52A8;&#x9A7E;&#x9A76;&#x5168;&#x6808;&#x7CFB;&#x7EDF;&#x8BC4;&#x4F30;&#x51C6;&#x5219;&#x3002;&#x9996;&#x5148;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x4FDD;&#x8BC1;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;&#x4F8B;&#x5982;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x7F16;&#x7A0B;&#x8005;&#x662F;&#x5426;&#x5728;&#x9AD8;&#x6E05;&#x5730;&#x56FE;&#x91CC;&#x9762;&#x7684;&#x901F;&#x5EA6;&#x9650;&#x5236;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x751F;&#x6210;&#x7684;&#x901F;&#x5EA6;&#x9650;&#x5236;&#x3002;&#x7136;&#x800C;&#x8FD9;&#x4E9B;&#x68C0;&#x67E5;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x72B6;&#x6001;&#x5207;&#x6362;&#x64CD;&#x4F5C;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x4E9B;&#x72B6;&#x6001;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5728;&#x7ED9;&#x5B9A;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x573A;&#x666F;&#x3002; </p>
<p><img src="assets/1565271535000.png" alt="1565271535000"></p>
<p>&#x5BF9;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x4EE3;&#x7801;&#x662F;&#x5426;&#x80FD;&#x591F;&#x6309;&#x7167;&#x8BBE;&#x60F3;&#x6B63;&#x786E;&#x7684;&#x5904;&#x7406;&#x6240;&#x6709;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x6765;&#x5230;&#x4EFF;&#x771F;&#x6D4B;&#x8BD5;&#xFF0C;&#x5728;&#x7C7B;&#x4F3C;&#x4E0E;Carla&#x8FD9;&#x6837;&#x7684;&#x4EFF;&#x771F;&#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x72B6;&#x6001;&#x673A;&#x5728;&#x8BBE;&#x8BA1;&#x53BB;&#x5904;&#x7406;&#x7684;&#x573A;&#x666F;&#x4E2D;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x72B6;&#x6001;&#x673A;&#x7684;&#x8F6C;&#x6362;&#x64CD;&#x4F5C;&#x4EE5;&#x53CA;&#x72B6;&#x6001;&#x8986;&#x76D6;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;&#x4EFF;&#x771F;&#x6D4B;&#x8BD5;&#x7684;&#x6570;&#x76EE;&#x9700;&#x8981;&#x80FD;&#x591F;&#x4EE3;&#x8868;&#x5728;&#x5F53;&#x524D;&#x9A7E;&#x9A76;&#x73AF;&#x5883;&#x4E2D;&#x78B0;&#x5230;&#x7684;&#x6240;&#x6709;&#x573A;&#x666F;&#x4EE5;&#x8986;&#x76D6;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x80FD;&#x6F0F;&#x6389;&#x7684;&#x7279;&#x4F8B;&#x3002;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x6D4B;&#x8BD5;&#x96C6;&#x5408;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x573A;&#x666F;&#x7684;&#x590D;&#x6742;&#x6027;&#x589E;&#x52A0;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x6DF1;&#x5EA6;&#x6D4B;&#x8BD5;&#xFF0C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x786E;&#x8BA4;&#x6211;&#x4EEC;&#x7684;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x5728;&#x4EFF;&#x771F;&#x73AF;&#x5883;&#x4E0B;&#x80FD;&#x591F;&#x6309;&#x7167;&#x8BBE;&#x60F3;&#x4E2D;&#x7684;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6D4B;&#x8BD5;&#x6D4B;&#x8BD5;&#x5728;&#x4EFF;&#x771F;&#x73AF;&#x5883;&#x4E0B;&#x5F88;&#x96BE;&#x51C6;&#x786E;&#x786E;&#x5B9A;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x6BD4;&#x5982;&#x53C2;&#x6570;&#x8C03;&#x8BD5;&#x4EE5;&#x53CA;&#x5728;&#x771F;&#x5B9E;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x611F;&#x77E5;&#x566A;&#x58F0;&#x548C;&#x8BEF;&#x5DEE;&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x4E0A;&#x8DEF;&#x9A8C;&#x8BC1;&#x6D4B;&#x8BD5;&#xFF0C;&#x7531;&#x4E8E;&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6B32;&#x6D4B;&#x8BD5;&#x90FD;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x53D7;&#x63A7;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x8FDB;&#x884C;&#xFF0C;&#x8DEF;&#x6D4B;&#x5177;&#x6709;&#x9AD8;&#x5EA6;&#x7684;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x7ECF;&#x5E38;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x5728;&#x5DE5;&#x7A0B;&#x5E08;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5230;&#x7684;&#x573A;&#x666F;&#x4E0B;&#x5931;&#x6548;&#x3002;&#x56E0;&#x6B64;&#x65B0;&#x7684;&#x9A8C;&#x8BC1;&#x6D4B;&#x8BD5;&#x9700;&#x8981;&#x5728;&#x524D;&#x9762;&#x73AF;&#x8282;&#x7684;&#x6D4B;&#x8BD5;&#x4E2D;&#x52A0;&#x5165;&#x3002;</p>
<hr>
<h3 id="6-&#x603B;&#x7ED3;">6. &#x603B;&#x7ED3;</h3>
<blockquote>
<ul>
<li>&#x57FA;&#x4E8E;&#x72B6;&#x6001;&#x673A;&#x7684;&#x884C;&#x4E3A;&#x89C4;&#x5212;&#x5668;&#x5904;&#x7406;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x573A;&#x666F;</li>
<li>&#x786E;&#x5B9A;&#x5C06;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x79BB;&#x6563;&#x5316;&#x73AF;&#x5883;&#x6A21;&#x578B;</li>
<li>&#x68C0;&#x67E5;&#x9700;&#x8981;&#x5B8C;&#x6574;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x7684;&#x72B6;&#x6001;</li>
<li>&#x5EFA;&#x7ACB;&#x72B6;&#x6001;&#x4E4B;&#x95F4;&#x7684;&#x5207;&#x6362;&#x64CD;&#x4F5C;&#x4EE5;&#x53CA;&#x5B89;&#x5168;&#x9AD8;&#x6548;&#x7684;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x6240;&#x9700;&#x8981;&#x7684;&#x72B6;&#x6001;&#x8F93;&#x51FA;</li>
<li>&#x5F3A;&#x8C03;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x4E14;&#x51C6;&#x786E;&#x7684;&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x8981;&#x7684;&#x6D4B;&#x8BD5;&#x6B65;&#x9AA4;</li>
</ul>
</blockquote>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x8282;&#x4E2D;&#x5B66;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#x4EE5;&#x53CA;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x64CD;&#x4F5C;&#x57DF;&#x3002;&#x4E00;&#x4E2A;&#x5728;&#x6240;&#x6709;&#x65B9;&#x5411;&#x90FD;&#x5B58;&#x5728;&#x505C;&#x6B62;&#x6807;&#x5FD7;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x573A;&#x666F;&#x3002;&#x6211;&#x4EEC;&#x7136;&#x540E;&#x8BA8;&#x8BBA;&#x4E86;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x5982;&#x4F55;&#x79BB;&#x6563;&#x5316;&#x80FD;&#x591F;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x8FDB;&#x884C;&#x4E0D;&#x540C;&#x72B6;&#x6001;&#x4E4B;&#x95F4;&#x7684;&#x5207;&#x6362;&#x3002;&#x63A5;&#x7740;&#x6211;&#x4EEC;&#x5EFA;&#x7ACB;&#x8D77;&#x4E86;&#x72B6;&#x6001;&#x4E4B;&#x95F4;&#x7684;&#x5207;&#x6362;&#x64CD;&#x4F5C;&#x6765;&#x5B9A;&#x4E49;&#x5728;&#x6574;&#x4E2A;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x7684;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x68C0;&#x67E5;&#x4E86;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x6211;&#x4EEC;&#x5728;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x6240;&#x6267;&#x884C;&#x7684;&#x9A7E;&#x9A76;&#x884C;&#x4E3A;&#x662F;&#x5426;&#x5408;&#x9002;&#x6240;&#x9700;&#x8981;&#x7684;&#x56DB;&#x4E2A;&#x6D4B;&#x8BD5;&#x6B65;&#x9AA4;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x540C;&#x6837;&#x573A;&#x666F;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x5C06;&#x4F1A;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x72B6;&#x6001;&#x673A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x548C;&#x6709;&#x8DA3;&#x3002;&#x968F;&#x540E;&#x89C1;&#x3002;</p>
<hr>
<h2 id="&#x7B2C;&#x4E09;&#x8282;-&#x5904;&#x7406;&#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x573A;&#x666F;">&#x7B2C;&#x4E09;&#x8282;: &#x5904;&#x7406;&#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#x573A;&#x666F;</h2>
<h3 id="&#x5B66;&#x4E60;&#x76EE;&#x6807;">&#x5B66;&#x4E60;&#x76EE;&#x6807;</h3>
<blockquote>
<ul>
<li>&#x56DE;&#x987E;&#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;</li>
<li>&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x7684;&#x72B6;&#x6001;&#x673A;&#x4E2D;&#x52A0;&#x5165;&#x52A8;&#x6001;&#x7269;&#x4F53;</li>
<li>&#x5EFA;&#x7ACB;&#x8D77;&#x5904;&#x7406;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x65F6;&#x5019;&#x7684;&#x590D;&#x6742;&#x6027;&#x548C;&#x7279;&#x4F8B;&#x7684;&#x7406;&#x89E3;</li>
</ul>
</blockquote>
<p>Welcome to the third video this week on behavior planning. In the last video, we developed a basic behavior planner using a finite state machine for a four-way intersection without traffic. We now focus on incorporating traffic interactions in the same four-way intersection. In today&apos;s lesson, we will begin by reviewing some of the interactions with the dynamic object covered in previous modules, which we use throughout this lesson to safely interact with the other objects in the environment. We will then extend the state machine that we had built in the previous lesson to include these interactions with other vehicles. Finally, we will briefly discuss the many edge cases and various complexities that occur when dealing with dynamic objects. Let&apos;s dive in. </p>
<hr>
<h3 id="1-&#x56DE;&#x987E;---&#x573A;&#x666F;&#x8BC4;&#x4F30;&#x4EE5;&#x53CA;&#x79BB;&#x6563;&#x5316;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;">1. &#x56DE;&#x987E; - &#x573A;&#x666F;&#x8BC4;&#x4F30;&#x4EE5;&#x53CA;&#x79BB;&#x6563;&#x5316;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;</h3>
<p>Once again, the scenario we study in this video is a single lane four-way stop intersection. We would like to be able to travel in any possible direction through this intersection, while now handling interaction with other vehicles. </p>
<p><img src="assets/1565351398895.png" alt="1565351398895"></p>
<p>Recall that in the previous lesson, we broke up the intersection into three areas or zones. The approaching zone highlighted in red, represents when a vehicle should decelerate to stop at the intersection. </p>
<p><img src="assets/1565351463281.png" alt="1565351463281"></p>
<p>The ad zone highlighted in green, is where the vehicle should stop prior to entering the intersection. The on zone in orange, which represents the intersection itself. The zone&apos;s size can be shifted based on the ego and dynamic velocities, as well as the size of the intersection. </p>
<hr>
<h3 id="2-&#x56DE;&#x987E;---&#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;">2. &#x56DE;&#x987E; - &#x5B58;&#x5728;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;</h3>
<p>Throughout this lesson, we will be focusing on the interactions with other dynamic objects, specifically other vehicles. In order to be able to safely deal with these vehicles, one important aspect is a measurement of the distance to various interaction points with the other objects. </p>
<p><img src="assets/1565351558452.png" alt="1565351558452"></p>
<p>The first distance measure to consider, is the distance to dynamic objects. This is defined as the Euclidean distance between the current ego position to the center of any dynamic object in the environment. The second is the distance to collision point, which is the distance to a potential collision point with another dynamic object. Finally, the time to collision is the time it would take to reach the given collision point. Our approach to calculating this was discussed in the previous video. </p>
<hr>
<h3 id="3-&#x72B6;&#x6001;&#x673A;&#x7684;&#x72B6;&#x6001;">3. &#x72B6;&#x6001;&#x673A;&#x7684;&#x72B6;&#x6001;</h3>
<p>Now let&apos;s expand a finite state machine to accommodate the added complexity of the dynamic objects. We will need to increase the required maneuvers to four in order to correctly handle all interactions with vehicles in this scenario. </p>
<p>First, let&apos;s review the maneuvers we included in our first version of the finite state machine. These were: track speed, who&apos;s only constraint is the speed of the given road, decelerate to stop, which requires the ego vehicle to decelerate to a stop point at a specific location in the environment, and stop, where we remained in the stop position. The new maneuver we need to add is follow leader. This maneuver state requires the ego vehicle to follow the speed of and maintain a safe distance to a lead vehicle, which is any vehicle directly in front of it in its lane. The safe distance is speed dependent and both safe speed and safe distance are updated as entry actions on every iteration of the behavior planner. </p>
<p><img src="assets/1565351746845.png" alt="1565351746845"></p>
<p>Now that we have all of the states defined for our expanded finite state machine, we turn to populating the transitions. We will do this in a similar fashion to the previous lesson, starting at a given state and then identifying all of the transitions out of that state before proceeding to the next. We&apos;ll display progress through the intersection as we define transitions in a pictorial representation of the scenario seen here on the left, and we&apos;ll build up the finite state machine on the right. </p>
<h4 id="&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;">&#x901F;&#x5EA6;&#x8DDF;&#x8E2A;</h4>
<p>In each pictorial representation, the autonomous ego vehicle will be denoted by a red arrow. We will then start as we did in the previous lesson with the ego vehicle being located outside the intersection in the track speeds state. Much as we&apos;ve seen in the previous lesson, the ego vehicle will only move to the decelerate to stop state once in the approaching zone. However, there is an additional concern, the situation in which another vehicle appears or enters the lane in front of the ego vehicle. In this case, we will move to attempt to follow the vehicle by performing a follow check. </p>
<p><img src="assets/1565351891851.png" alt="1565351891851"></p>
<p>The follow check can be decomposed into two elements. A distance check and a same lane check. The distance check confirms that the vehicle is close enough such that it should be followed. In the same lane check confirms that the vehicle is actually in the same lane as the ego vehicle. In this case, we can use distance to dynamic object, which is the Euclidean distance to the object and compare that to a threshold. There are several methods which can be employed to check if the vehicle is in the same lane as the ego vehicle. However for simplicity, we will check if the lead vehicle is within the lane limits and if the heading of the dynamic object is within a given threshold to that of the ego vehicle indicating it is moving in the same direction. </p>
<h4 id="&#x8DDF;&#x524D;&#x8F66;&#x884C;&#x9A76;">&#x8DDF;&#x524D;&#x8F66;&#x884C;&#x9A76;</h4>
<p>In the follow leaders state, we define only two transitions. First, the lead vehicle might exit the lean before the ego vehicle is approaching or at the intersection, resulting in a switch to the track speed state. Or the lead vehicle drives out of the current lane, usually, onto the intersection when the ego vehicle is already in the at or approaching zones, resulting in a direct transition to the decelerate to stop state. </p>
<p><img src="assets/1565352009046.png" alt="1565352009046"></p>
<p>We add the transition condition, that the distance to collision is greater than the distance to the stop point when the ego vehicle is either in the approach or add zones. In this situation, the ego vehicles should transition to decelerate to stop and set the stop point to the correct location at the stop line of the intersection. </p>
<p><img src="assets/1565352056140.png" alt="1565352056140"></p>
<h4 id="&#x51CF;&#x901F;&#x505C;&#x6B62;">&#x51CF;&#x901F;&#x505C;&#x6B62;</h4>
<p>As before, in the decelerate to stop state, the ego vehicle continues decelerating until the time when it comes to a stop at the stop line. Which will result in a switch to the stop state as seen in our previous lesson. </p>
<p><img src="assets/1565414989998.png" alt="1565414989998"></p>
<p>However, we once again have to take into account that a vehicle is able to pull in front of the autonomous car at an intersection, either from a driveway or an overtaking maneuver. Much as before, we perform the follow check throughout the decelerate to stop state when the ego vehicle is in the approaching or add zones, and transition to follow leader if the check returns true. In this case however, the distance check considers whether the lead vehicle distance to collision is less than the stop point distance, so that the leader following modes should take precedence. </p>
<p><img src="assets/1565415061448.png" alt="1565415061448"></p>
<h4 id="&#x505C;&#x8F66;">&#x505C;&#x8F66;</h4>
<p>Finally, to complete our expansion of the finite state machine, let&apos;s look at the situations we can face once stopped. To keep things simple, we&apos;ll assume a very conservative driving style, where our autonomous car waits until all vehicles have cleared the approaching, at, or on intersections zones before proceeding through it. We leave the implementation of precedents at the stop sign for you to explore on your own. </p>
<p><img src="assets/1565415160190.png" alt="1565415160190"></p>
<p>Further, we&apos;ll define simple checks for a rectilinear intersections, that identify all vehicles direction of travel with four easy labels and only consider other vehicles moving straight through the intersection. Relative to the ego vehicles body frame, a vehicle object with a relative heading of between minus 45 and 45 degrees, will be labeled as going in the same direction as the ego vehicle. </p>
<p><img src="assets/1565415271973.png" alt="1565415271973"></p>
<p>A vehicle between minus 45 and 135 degrees relative heading, will be labeled as heading to the right. Between minus 135 and 135 as heading towards the ego vehicle and finally, between 45-135 degrees relative heading, will be labeled as going to the left. This simplification can be improved using predicted paths for the dynamic objects, especially if additional perception information is available to improve prediction of the direction of travel through the intersection. We can now define the transitions out of the stop state. Will have two sets of transitions. Either follow leader or track speed, depending on whether a vehicle is present within the lane through the intersection that satisfies the follow check. </p>
<p><img src="assets/1565415303194.png" alt="1565415303194"></p>
<p>In each case, the transition conditions change based on the path through the intersection required by our mission plan. When the ego vehicle needs to turn left, any vehicle approaching from the left, right, or any oncoming vehicle, must clear the on intersection zone before the ego vehicle can proceed. When the ego vehicle needs to go straight, only vehicles approaching from the left or right, need to clear the intersection. </p>
<p><img src="assets/1565415363019.png" alt="1565415363019"></p>
<p>Finally, when the ego vehicle needs to turn right, only vehicles approaching from the left need to clear the intersection. From this simple definition of the transitions out of the stop state, we hope you can visualize the additional checks needed to handle the precedence due to arrival order at an intersection and the possibility that the other vehicles might also turn left or right. </p>
<hr>
<h3 id="4-&#x72B6;&#x6001;&#x673A;&#x5207;&#x6362;&#x64CD;&#x4F5C;">4. &#x72B6;&#x6001;&#x673A;&#x5207;&#x6362;&#x64CD;&#x4F5C;</h3>
<p>The resulting full state machine includes the following states and transitions. </p>
<p><img src="assets/1565415496491.png" alt="1565415496491"></p>
<p>While this state machine is unable to be used on a real autonomous vehicle due to the oversimplifications we relied on, it serves as a good demonstration of the process of converting a given operational design domain into a functional finite state machine. You&apos;re now ready to start tackling more complex scenarios with more complete dynamic object models. </p>
<hr>
<h3 id="5-&#x52A8;&#x6001;&#x7269;&#x4F53;&#x4E0D;&#x80FD;&#x5904;&#x7406;&#x7684;&#x7279;&#x4F8B;">5. &#x52A8;&#x6001;&#x7269;&#x4F53;&#x4E0D;&#x80FD;&#x5904;&#x7406;&#x7684;&#x7279;&#x4F8B;</h3>
<p>So far throughout the creation of a state machine, we have made one particularly <strong>strong assumption</strong> about how dynamic objects behave. Namely, that all dynamic objects obey the rules of the road. However, this is not always the case, and this difficulty leads to many edge cases that also need to be considered. </p>
<p><img src="assets/1565415572068.png" alt="1565415572068"></p>
<p>Let&apos;s quickly discuss a few examples of what can go wrong with this strong assumption. The first example would be when a driver unintentionally swerves into oncoming traffic, entering the lane of the ego vehicle. This actually happened to a Waymo van in 2018, when a driver careened over a median into oncoming traffic. Another example, is of an aggressive driver racing through an intersection even as the ego vehicle has begun driving through it. Another common example, is when a vehicle fails to stop at the intersection. </p>
<p>Finally, I will end with the case of a vehicle which is parked in close proximity to the intersection. If this vehicle is not tagged as parked, so that it might be treated as a static instead of dynamic object, our behavior planner may get stuck in a deadlock state waiting for this parked vehicle to move. This is by no means a complete set of all possibilities, and one of the primary objectives of behaviors safety assessment and testing, is to uncover as many variations of unexpected behaviors as possible, so that they also can be detected, categorized, and incorporated into the behavior planning design process. </p>
<p>Just simply uncovering edge cases is not enough, however. Rather we must define how the autonomous vehicles should react to every one of these cases. For this emergency maneuvers such as a swerve or a hard break are required, with many more transitions and conditions to define. This is an active area of research and development and we&apos;ve included some additional resources in the supplemental materials, if you&apos;d like to find out more. </p>
<hr>
<h3 id="6-&#x603B;&#x7ED3;">6. &#x603B;&#x7ED3;</h3>
<blockquote>
<ul>
<li>Build upon the previous lesson to include dynamic objects as part of the state machine</li>
<li>Developing an understanding of the complexities and edge cases when dealing with dynamic objects</li>
</ul>
</blockquote>
<p>In summary, in today&apos;s video, we learned how we can create a finite state machine, able to interact with dynamic objects which follow the rules of the road. We saw why dealing with dynamic objects is so challenging by looking at just a few of the many possible edge cases which they can create. In our next lesson, we will see how we can continue building our behavior planner to be able to handle multiple scenarios simultaneously. We&apos;ll see you next time.</p>
<hr>
<h2 id="&#x7B2C;&#x56DB;&#x8282;-&#x5904;&#x7406;&#x591A;&#x79CD;&#x573A;&#x666F;">&#x7B2C;&#x56DB;&#x8282;: &#x5904;&#x7406;&#x591A;&#x79CD;&#x573A;&#x666F;</h2>
<h3 id="&#x5B66;&#x4E60;&#x76EE;&#x6807;">&#x5B66;&#x4E60;&#x76EE;&#x6807;</h3>
<blockquote>
<ul>
<li>Develop a larger overarching state machine which includes multiple scenarios</li>
<li>Develop a method to switch between driving scenarios</li>
</ul>
</blockquote>
<p>Welcome to the fourth video in the behavior planning module. In the last video, we introduced dynamic objects into our finite state machine behavior planner. In this video, we will develop a larger behavior planner which is able to manage the decision process for multiple scenarios simultaneously. We will do this by introducing the notion of a hierarchical finite state machine. We will also develop a method to switch between each of the driving scenarios as they occur. Let&apos;s begin. </p>
<hr>
<h3 id="1-&#x76EE;&#x524D;&#x5DF2;&#x8986;&#x76D6;&#x573A;&#x666F;&#x4EE5;&#x53CA;&#x591A;&#x79CD;&#x573A;&#x666F;">1. &#x76EE;&#x524D;&#x5DF2;&#x8986;&#x76D6;&#x573A;&#x666F;&#x4EE5;&#x53CA;&#x591A;&#x79CD;&#x573A;&#x666F;</h3>
<p>So far in this module, we have developed a finite state machine behavior planner that can handle a single four-way stop intersection scenario with dynamic objects. </p>
<p><img src="assets/1565416476135.png" alt="1565416476135"></p>
<p>However, in driving, there are many such scenarios which will be encountered. For example, there are three-way stop intersections, traffic light controlled intersections, and straight road scenarios, just to name a few. </p>
<p><img src="assets/1565416497150.png" alt="1565416497150"></p>
<p>While many of these scenarios share some similarities largely due to the logic required to handle them, each of the scenarios can be considered to require fundamentally different driving behaviors. </p>
<hr>
<h3 id="2-&#x5355;&#x4E00;&#x72B6;&#x6001;&#x673A;">2. &#x5355;&#x4E00;&#x72B6;&#x6001;&#x673A;</h3>
<p>One method of handling these multiple scenarios is by adding additional states, transitions and conditions to a single state machine in an ever-expanding network of behaviors. However, there are several problems with this approach. The first problem is that we would need to develop additional logic to differentiate the current scenario, as well as the rules needed to handle each scenario individually. </p>
<p><img src="assets/1565416763449.png" alt="1565416763449"></p>
<p>This quickly runs into a problem known as rule explosion, in which the number of rules required to add additional scenarios becomes unimaginably large. The second problem with a single state machine is that due to the number of extra rules and transitions that need to be evaluated at each step, the computational time required significantly increases, and lastly, such a system is complicated to create and maintain as a number of cases which one must worry about increases quickly. Essentially, as the complexity increases, we lose all the advantages of using a finite state machine that were highlighted back in lesson one. </p>
<hr>
<h3 id="3-&#x591A;&#x4E2A;&#x72B6;&#x6001;&#x673A;">3. &#x591A;&#x4E2A;&#x72B6;&#x6001;&#x673A;</h3>
<p>There is however, another approach we can use. We can represent each high level scenario as a single state. This would allow us to create much simpler transitions in between the high level scenario states. In this example, we can see that the states represent a straight road scenario and the four-way intersection scenario we worked with previously. </p>
<p><img src="assets/1565416875131.png" alt="1565416875131"></p>
<p>With each one of these high level scenario states, we will store a low-level state machine with which we can handle the scenario independently. For example, for the intersection scenario, the low-level state machine will be the one constructed over the last two lessons. This method of representation is known as a hierarchical state machine, with the super-states representing each scenario, and the sub-states representing the maneuvers to be handled in each scenario. </p>
<hr>
<h3 id="4-&#x5206;&#x7EA7;&#x72B6;&#x6001;&#x673A;">4. &#x5206;&#x7EA7;&#x72B6;&#x6001;&#x673A;</h3>
<p>The transitions between the high level scenario state machine would be a rule that defines when a new scenario has been entered, based on the HD roadmap and dynamic vehicle information. Let&apos;s say we have this simple hierarchical state machine with two scenarios, one for straight road with a pedestrian crossing, and another for a stop sign-based intersection. </p>
<p><img src="assets/1565416986746.png" alt="1565416986746"></p>
<p>To move from the straight road to the stop sign intersection, the autonomous vehicle has to be close to an encounter with this intersection. This is done with a distance check to the next intersection along the mission plan. All the movements which we have talked about here is at the super-state level. The next question we have to answer is, how do we switch between scenarios when processing the sub-state maneuvers? </p>
<hr>
<h3 id="5-&#x8FDB;&#x5165;&#x548C;&#x5207;&#x6362;&#x6761;&#x4EF6;-&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;">5. &#x8FDB;&#x5165;&#x548C;&#x5207;&#x6362;&#x6761;&#x4EF6;-&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;</h3>
<p>One method is to introduce transitions to key maneuver sub-states out of the current scenario super-state. Let us continue to use the intersection scenario as an example. First, let&apos;s establish which state will be the key exit state out of the scenario. The only way we&apos;re able to exit an intersection is while in the track speed or follow leader states after having passed the intersection. So let&apos;s put the exit transitions there. </p>
<p><img src="assets/1565417200533.png" alt="1565417200533"></p>
<p>The condition on the transitions would be to confirm that this scenario has indeed been completed. In this example, we can use the distance to the next stop sign intersection. If this is larger than a given threshold, we can exit the intersection scenario. With this method of transition, we were able to also maintain maneuvers between scenario switches. In this case, track speed in the intersection super-state will connect to the track speed of the next scenario that we enter. </p>
<hr>
<h3 id="6-&#x5206;&#x7EA7;&#x72B6;&#x6001;&#x673A;-&#x4F18;&#x52BF;&#x548C;&#x52A3;&#x52BF;">6. &#x5206;&#x7EA7;&#x72B6;&#x6001;&#x673A;-&#x4F18;&#x52BF;&#x548C;&#x52A3;&#x52BF;</h3>
<p>Adding an additional multi-lane scenario to this hierarchical state machine is done by creating a new super-state scenario node, with a sub-state state machine capable of handling that scenario. </p>
<p><img src="assets/1565417252343.png" alt="1565417252343"></p>
<p>This type of finite state machine has some inherent strengths and weaknesses. The strengths of this approach are due to it&apos;s subdivided nature. By creating individual state machines within each super-state, this method is able to limit the computational time required at any one time step by restructuring our sub-space. This subdivided nature also makes both testing and programming of a hierarchical state machine significantly easier. However, the hierarchical state machine is not without its problems, while limiting the number of rules required, this approach is still unable to handle rule explosion completely. </p>
<p><img src="assets/1565417307242.png" alt="1565417307242"></p>
<p>One reason for the large number of rules is that all scenarios have fully separated state machines, and thus many of the rules are duplicates of one another in order to handle similar behaviors in different scenarios. Ultimately, the hierarchical approach allows the system designer to handle a greater amount of complexity than a flat single layered finite state machine. The idea can be extended to multiple layers as long as key states can be defined at each level. In reality, the perspective enforced by finite state machines, that a single behavior is active at any given time, and that all transitions to other behaviors can be explicitly defined, has a limit on how large a set of scenarios it can handle. Nonetheless, it provides a useful tool for typical behavior planning in a self-driving car. </p>
<hr>
<h3 id="7-&#x603B;&#x7ED3;">7. &#x603B;&#x7ED3;</h3>
<blockquote>
<ul>
<li>Developing a larger overarching state machine which includes multiple scenarios</li>
<li>Develop a method to switch between driving scenarios</li>
</ul>
</blockquote>
<p>Let&apos;s summarize what we&apos;ve discussed in this video. We first introduced the hierarchical finite state machine, which is able to handle multiple scenarios simultaneously. We also discussed how to transition between the different driving scenarios at the super and sub-state levels, and we discussed the capabilities and limits of behavior planning with hierarchical finite state machines. Join us in our next video where we will discuss a range of advanced research approaches that are able to solve some of the issues we&apos;ve faced so far with behavior planning. See you there.</p>
<hr>
<h2 id="lesson-5-advanced-methods-for-behaviour-planning">Lesson 5: Advanced Methods for Behaviour Planning</h2>
<h3 id="learning-objectives">Learning Objectives</h3>
<blockquote>
<ul>
<li>Identify issues with the state machine based behaviour planner</li>
<li>Identify the open areas of research in behaviour planning</li>
</ul>
</blockquote>
<p>Welcome to the fifth and final video of the behavior planning module. In this video we will discuss the limitations of state machine based approaches to behavior planning. And we will then take a tour through some alternative behavior planning systems that aim to address some of these limitations. By the end of this video you should have a good overall picture of the main methods used in behavior planning. </p>
<hr>
<h3 id="1-state-machine-behaviour-planning-issues">1. State Machine Behaviour Planning Issues</h3>
<blockquote>
<ul>
<li>Rule-explosion when Dealing with Complex Scenarios</li>
<li>Dealing with a Noisy Environment</li>
<li>Hyperparameter Tuning</li>
<li>Incapable of Dealing with Unencountered Scenarios</li>
</ul>
</blockquote>
<p>Let&apos;s begin by identifying the issues with our state machine model. The first issue we identified throughout the development of this module is the issue of rule-explosion. This means that as we develop a more complete set of scenarios and maneuvers to handle the number of rules required grows very quickly. This limitation means that while it is possible to develop a finite state machine behavior planner to handle a limited operational design domain. </p>
<p>Developing a full level four or five capable vehicle is almost impossible with finite state machines. Dealing with a noisy environment is the next issue. While we saw in lesson two and three how the addition of <strong>hyperparameters</strong> can be used to deal with some noise. This type of noise handling is only able to deal with some every limited situations. To deal with all types of input uncertainty different methods will be required. On that note, the next issue I would like to point out is the actual tuning of the hyperparameters. As the behaviors required get more complex, the number of hyperparameters to both discretize the environment and handle some of the low level noise grow rapidly. All these hyperparameters have to be tuned very carefully and this can be a lengthy process. </p>
<p>Finally, the last issue we&apos;ll discuss is handling of unencountered situations. Due to the program nature of this approach it is very likely that there will arise a situation in which the programmed logic of the system will react in an incorrect or unintended manner. State machine based approaches are classified as experts systems, systems which have been designed and develop by human experts. However, state machines are not the only such expert systems devised. There are also approaches that rely on a database of rules which are applied to the input data at every time step. </p>
<hr>
<h3 id="2-rule-based-behaviour-planner">2. Rule-Based Behaviour Planner</h3>
<p>The rules are formed into a hierarchy where safety critical rules take precedence, override comfort rules, or defensive driving rules, for example. Each rule is engaged only when the appropriate conditions arise for it to affect the selection of the output maneuver. </p>
<p><img src="assets/1565421509022.png" alt="1565421509022"></p>
<p>Such rule databases do not suffer from the problem of needing to duplicate the rules that we encountered with hierarchical state machines. As the rules can apply throughout the ODD or over significant portions of it. However, rule based systems have to very carefully develop rules in such a way that they do not negatively impact each other. Or lead to unintended outcomes when multiple rules are activated at the same time. Due to the common reliance on expert users to design for all possible scenarios, both types of expert systems suffer from the same issues described above. </p>
<hr>
<h3 id="3-fuzzy-logic">3. Fuzzy Logic</h3>
<p>One possible solution to some of the problems we&apos;ve identified above is to extend the human expert type plan or to incorporate Fuzzy logic. Fuzzy logic is a system by which a set of crisp, well-defined values are used to create a more continuous set of fuzzy states. For a simple example of how a Fuzzy based system works, let&apos;s take a look at the example of the vehicle following behavior. </p>
<p><img src="assets/1565418151697.png" alt="1565418151697"></p>
<p>While previously we set a parametrized distance which divided the space into follow the vehicle or do not follow the vehicle. With a Fuzzy system we&apos;re able to have a continuous space over which different rules can be applied. For example, a Fuzzy system might react strongly to a lead vehicle when very close to it. But be less concerned with the speed matching or distance following requirements when it&apos;s further away. While Fuzzy based rule systems are able to deal with the environmental noise of a system to a greater degree than traditional discreet systems. Both rule-explosion and hyperparameter tuning remain issues with Fuzzy systems. In fact, Fuzzy systems can result in rule-explosion to an even greater degree, as even more logic is required to handle the fuzzy set of inputs. Accompanying the rule-explosion is a large challenge in hyperparameter tuning as well. </p>
<hr>
<h3 id="4-reinforcement-learning">4. Reinforcement Learning</h3>
<p>The next exciting research approach I&apos;d like to discuss is the use of reinforcement learning for behavior planning. Reinforcement learning is a form of machine learning in which an agent learns how to interact with a given environment by taking action and receiving a continuous reward. The agent begins by engaging in play with a simulated environment. Which means that at the start the agent will not be good at the particular task, however, over time as the agent maximizes its reward, they eventually learn to master the task. By learning in a simulated environment, no real world repercussions occurred during the many failures experienced during learning. </p>
<p><img src="assets/1565418298243.png" alt="1565418298243"></p>
<p>More specifically, we can say the agent is attempting to learn a policy, denoted by p, which maps a given environment, denoted by s, to a given actions, denoted by a. To connect the concept of reinforcement learning to behavior planning let&apos;s say we&apos;re attempting to teach the autonomous vehicle how to follow a lead vehicle. In this case our policy p will be attempting to do vehicle following. Our actions may be explicitly defined as behaviors to execute or can define behaviors implicitly through selection of desired accelerations and turn rates. The environment can be represented by a continuous set of variables telling us relevant information, such as distance to all objects and our mission path. And, finally, the reward function could be based on an optimal following distance. And give the highest reward at the preferred distance, penalizing getting too close more heavily than being too far away. </p>
<p><img src="assets/1565418316216.png" alt="1565418316216"></p>
<p>Because of the extremely large variety of scenarios and inputs that an autonomous vehicle can encounter, direct reinforcement learning for behavior planning is unlikely to succeed. Instead some further adaptations are usually applied. <strong>One such adaptation is known as hierarchical reinforcement learning.</strong> Where we divide the problem into low level policies in the maneuver space and high level policies the scenarios. This is similar to the hierarchical finite state machine. Then each low level policy is learned independently and only once successfully learned a high level policy can be learned to complete a scenario. <strong>The second technique often applied is called model-based reinforcement learning.</strong> In model-based reinforcement learning not only is the agent attempting to learn a policy, p, but also a model of the current environment around the agent. An example of how this approach might apply to behavior planning for self driving cars would be to include a model of the movement of dynamic objects. If the agent understands the movement patterns of the dynamic object it can create more effective plans through the environment. </p>
<hr>
<h3 id="5-reinforcement-learning-issues">5. Reinforcement Learning Issues</h3>
<p>While reinforcement learning is a very exciting and highly promising area of research it too is not without its own limitations. Many simulation environments used to learn the policies required for autonomous driving are overly simplified. And due to their simplicity the policies learned may not be transferable to real world environments. Overly realistic simulators lead to the issue of severe computational requirements. Especially when running thousands of repetitions of widely varying scenarios for self driving learning. </p>
<p><img src="assets/1565418558805.png" alt="1565418558805"></p>
<p>The second is an issue concerning safety. While there are techniques within reinforcement learning that attempt to ensure safety constraints along the trajectories created by the reinforcement learner. There is still no way to perform rigorous safety assessment of a learned system, as they are mostly black boxes in terms of the way in which decisions are made. </p>
<hr>
<h3 id="6-machine-learning">6. Machine Learning</h3>
<p>Many other interesting ideas are also being explored right now in the research community and many of them try to learn from human driving actions. For example, in inverse reinforcement learning rather than trying to obtain a policy given a reward function, the approach is to use human driving data as the policy. An attempt to learn the reward function used by humans. Once the reward function is learned the algorithm can then execute driving maneuvers similarly to a human driver. </p>
<p><img src="assets/1565418604011.png" alt="1565418604011"></p>
<p>Finally, end-to-end approaches take as an input raw sensor data and attempt to output throttle, break, and steering commands. By learning, once again, from human driving commands in an imitation learning approach. This approach was pioneered by researchers at Nvidia with their paper, End to End Learning for Self-Driving Cars. While this is not explicitly classified as behavior planning, the end-to-end approach still implicitly performs the task of behavior selection as part of its output selection process. These brief explanations only scratched the surface of a huge and rapidly evolving research area. Behavior planning remains one of the hotbeds of activity in autonomous driving research. And one of the toughest bottlenecks in achieving real world level five autonomy. We&apos;ve included a reading list of some of the recent work in this area in the supplemental materials for those interested in learning more.</p>
<ul>
<li>J. Wei, J. M. Snider, T. Gu, J. M. Dolan, and B. Litkouhi, &#x201C;<a href="https://ieeexplore.ieee.org/abstract/document/6856582" target="_blank">A behavioral planning framework for autonomous driving</a>,&#x201D; 2014 IEEE Intelligent Vehicles Symposium Proceedings, 2014. This gives a nice overview of an example framework that can be used in behaviour planning.</li>
<li>R. S. Sutton and A. G. Barto, <a href="http://incompleteideas.net/book/the-book-2nd.html" target="_blank">Reinforcement learning an introduction</a>. Cambridge: A Bradford Book, 1998. Gives a great introduction to reinforcement learning concepts.</li>
</ul>
<hr>
<h3 id="7-summary">7. Summary</h3>
<blockquote>
<ul>
<li>Identify issues with the state machine based behaviour planner</li>
<li>Identify the open areas of research in behaviour planning</li>
</ul>
</blockquote>
<p>Let&apos;s summarize what we&apos;ve discussed in this video. We presented some of the issues with finite state machine based planning. And presented multiple advanced approaches to the problem of behavior planning which seek to address the full complexity of the behavior planning problem. And with that we have come to the end of our behavior planning module. In this module we&apos;ve defined the requirements needed to make a behavior planning system capable of autonomous driving. Then we walked through the creation of such a system for a specific scenario, a four way intersection. We then added dynamic vehicle interactions and expanded to incorporate multiple scenarios. We ended with a brief review of a few exciting methods emerging from the behavior planning research community. Join us for the next module where we will build a full local planning solution using parameterized curves and nonlinear optimization, until then. </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../Module 4 - Dynamic Object Interactions/Module 4 - Dynamic Object Interactions.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Module 4 - Dynamic Object Interactions">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Module 5 - Principles of Behaviour Planning","level":"1.2.2","depth":2,"previous":{"title":"Module 4 - Dynamic Object Interactions","level":"1.2.1","depth":2,"path":"Part4 - Motion Planning for Self-Driving Cars/Module 4 - Dynamic Object Interactions/Module 4 - Dynamic Object Interactions.md","ref":"Part4 - Motion Planning for Self-Driving Cars/Module 4 - Dynamic Object Interactions/Module 4 - Dynamic Object Interactions.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Part4 - Motion Planning for Self-Driving Cars/Module 5 - Principles of Behaviour Planning/Module 5 - Principles of Behaviour Planning.md","mtime":"2019-09-05T09:11:40.713Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-05T15:44:09.512Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

